//COMPDYN JOB (ACCT),'COMP DYNAMIC',CLASS=A,MSGCLASS=X
//  SET HLQ='Z88264'
//  SET PGM='LNCALC01'
//ST1 EXEC IGYWCL,PARM.COBOL='LIB,APOST,DYNAM'
//COBOL.SYSIN  DD DSN=&HLQ..ZBRIDGE.SUBSRC(&PGM),DISP=SHR
//COBOL.SYSLIB DD DSN=&HLQ..ZBRIDGE.COPYLIB,DISP=SHR
//LKED.SYSLMOD DD DSN=&HLQ..ZBRIDGE.LOADLIB(&PGM),DISP=SHR