//REPROJOB JOB (ACCT),'LOAD TO VSAM',CLASS=A,MSGCLASS=X
//STEP01   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO -
    INDATASET(Z88264.ZBRIDGE.TRANS) -
    OUTDATASET(Z88264.ZBRIDGE.MASTER)
/*